bricks/olymp/olymp/contest.kpml/2014.org
#+HTML_DOCTYPE: html5
#+OPTIONS: toc:nil num:nil ^:{} html5-fancy:t
#+MACRO: begin-block #+HTML: <div class="$1">
#+MACRO: end-block #+HTML: </div>

{{{begin-block(Page)}}}

* Открытая олимпиада КФМЛ «Командный турнир по программированию»

*9 ноября 2014 года* состоялась XVII открытая олимпиада КФМЛ
«Командный турнир по программированию». Она проходила в один день и на
том же наборе задач, что и командный чемпионат школьников
Санкт-Петербурга по программированию.

По результатам олимпиады, две первых команд получили право участвовать
во [[http://neerc.ifmo.ru/school/russia-team/index.html][Всероссийской командной]] олимпиаде школьников по программированию,
которая состоится в Санкт-Петербурге, Барнауле, Алматы, Ташкенте,
Тбилиси и Кременчуге 29-30 ноября 2014 года.

** Результаты

|-----+----------------------------------+----------+-----------+-----------+-----------+----------+-----------+----------+-----------+-----+-----+-----+--------+-------|
|   # | Команда                          | A        | B         | C         | D         | E        | F         | G        | H         | I   | J   | K   | Задачи | Штраф |
|-----+----------------------------------+----------+-----------+-----------+-----------+----------+-----------+----------+-----------+-----+-----+-----+--------+-------|
| <r> | <l>                              | <c>      | <c>       | <c>       | <c>       | <c>      | <c>       | <c>      | <c>       | <c> | <c> | <c> | <c>    |       |
|  32 | FML-LND (Сыктывкар, КРФМЛИ)      | + (0:15) | + (1:13)  | +2 (4:49) | + (1:50)  | + (2:36) | +5 (3:33) | + (3:02) | + (1:31)  |     | -2  |     | 8      |  1269 |
|  38 | Шитенгара (Киров, КФМЛ)          | + (0:15) | +1 (2:03) |           | + (2:33)  | -3       | -3        | -1       | +1 (1:22) |     | -2  |     | 4      |   413 |
|  37 | Язь и Компилятор (Киров, КФМЛ)   | + (0:07) | + (0:38)  |           | + (2:21)  | -2       |           |          | -1        |     |     |     | 3      |   186 |
|  30 | Galaxy_Grace_Style (Киров, КФМЛ) | + (0:06) | + (0:18)  |           | -1        |          | -3        | -3       | + (4:04)  |     | -2  |     | 3      |   268 |
|  31 | Da Red (Киров, ЛЕН)              | + (0:12) | + (2:12)  |           | +1 (4:42) |          | -4        |          | -4        |     | -4  |     | 3      |   446 |
|  33 | Бест (Киров, КЭПЛ)               | + (0:18) | +1 (1:55) |           |           |          |           |          | -2        |     |     |     | 2      |   153 |
|  36 | И один в поле воин (Киров, КФМЛ) | + (0:24) | -2        |           |           | -1       |           |          |           |     |     |     | 1      |    24 |
|  34 | F1 (Киров, СОШ 28)               | + (0:27) | -2        |           | -5        |          | -2        |          |           |     |     |     | 1      |    27 |
|  35 | F1(28) (Киров, СОШ 28)           | + (0:27) |           | -1        |           |          | -4        |          |           |     |     |     | 1      |    27 |
|-----+----------------------------------+----------+-----------+-----------+-----------+----------+-----------+----------+-----------+-----+-----+-----+--------+-------|


** Материалы

+ [[http://neerc.ifmo.ru/school/archive/2014-2015.html#spb-team][Материалы авторов задач]]
+ [[./2014-runs.7z][Архив подходов участников]]

{{{end-block}}}
