bricks/olymp/olymp/contest.kpml/2014.html
<div class="Page">

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Открытая олимпиада КФМЛ «Командный турнир по программированию»</h2>
<div class="outline-text-2" id="text-1">
<p>
<b>9 ноября 2014 года</b> состоялась XVII открытая олимпиада КФМЛ
«Командный турнир по программированию». Она проходила в один день и на
том же наборе задач, что и командный чемпионат школьников
Санкт-Петербурга по программированию.
</p>

<p>
По результатам олимпиады, две первых команд получили право участвовать
во <a href="http://neerc.ifmo.ru/school/russia-team/index.html">Всероссийской командной</a> олимпиаде школьников по программированию,
которая состоится в Санкт-Петербурге, Барнауле, Алматы, Ташкенте,
Тбилиси и Кременчуге 29-30 ноября 2014 года.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1">Результаты</h3>
<div class="outline-text-3" id="text-1-1">
<table>


<colgroup>
<col  class="right">

<col  class="left">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="center">

<col  class="right">
</colgroup>
<thead>
<tr>
<th scope="col" class="right">#</th>
<th scope="col" class="left">Команда</th>
<th scope="col" class="center">A</th>
<th scope="col" class="center">B</th>
<th scope="col" class="center">C</th>
<th scope="col" class="center">D</th>
<th scope="col" class="center">E</th>
<th scope="col" class="center">F</th>
<th scope="col" class="center">G</th>
<th scope="col" class="center">H</th>
<th scope="col" class="center">I</th>
<th scope="col" class="center">J</th>
<th scope="col" class="center">K</th>
<th scope="col" class="center">Задачи</th>
<th scope="col" class="right">Штраф</th>
</tr>
</thead>
<tbody>
<tr>
<td class="right">32</td>
<td class="left">FML-LND (Сыктывкар, КРФМЛИ)</td>
<td class="center">+ (0:15)</td>
<td class="center">+ (1:13)</td>
<td class="center">+2 (4:49)</td>
<td class="center">+ (1:50)</td>
<td class="center">+ (2:36)</td>
<td class="center">+5 (3:33)</td>
<td class="center">+ (3:02)</td>
<td class="center">+ (1:31)</td>
<td class="center"> </td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center">8</td>
<td class="right">1269</td>
</tr>

<tr>
<td class="right">38</td>
<td class="left">Шитенгара (Киров, КФМЛ)</td>
<td class="center">+ (0:15)</td>
<td class="center">+1 (2:03)</td>
<td class="center"> </td>
<td class="center">+ (2:33)</td>
<td class="center">-3</td>
<td class="center">-3</td>
<td class="center">-1</td>
<td class="center">+1 (1:22)</td>
<td class="center"> </td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center">4</td>
<td class="right">413</td>
</tr>

<tr>
<td class="right">37</td>
<td class="left">Язь и Компилятор (Киров, КФМЛ)</td>
<td class="center">+ (0:07)</td>
<td class="center">+ (0:38)</td>
<td class="center"> </td>
<td class="center">+ (2:21)</td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-1</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">3</td>
<td class="right">186</td>
</tr>

<tr>
<td class="right">30</td>
<td class="left">Galaxy_Grace_Style (Киров, КФМЛ)</td>
<td class="center">+ (0:06)</td>
<td class="center">+ (0:18)</td>
<td class="center"> </td>
<td class="center">-1</td>
<td class="center"> </td>
<td class="center">-3</td>
<td class="center">-3</td>
<td class="center">+ (4:04)</td>
<td class="center"> </td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center">3</td>
<td class="right">268</td>
</tr>

<tr>
<td class="right">31</td>
<td class="left">Da Red (Киров, ЛЕН)</td>
<td class="center">+ (0:12)</td>
<td class="center">+ (2:12)</td>
<td class="center"> </td>
<td class="center">+1 (4:42)</td>
<td class="center"> </td>
<td class="center">-4</td>
<td class="center"> </td>
<td class="center">-4</td>
<td class="center"> </td>
<td class="center">-4</td>
<td class="center"> </td>
<td class="center">3</td>
<td class="right">446</td>
</tr>

<tr>
<td class="right">33</td>
<td class="left">Бест (Киров, КЭПЛ)</td>
<td class="center">+ (0:18)</td>
<td class="center">+1 (1:55)</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">2</td>
<td class="right">153</td>
</tr>

<tr>
<td class="right">36</td>
<td class="left">И один в поле воин (Киров, КФМЛ)</td>
<td class="center">+ (0:24)</td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-1</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="right">24</td>
</tr>

<tr>
<td class="right">34</td>
<td class="left">F1 (Киров, СОШ 28)</td>
<td class="center">+ (0:27)</td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center">-5</td>
<td class="center"> </td>
<td class="center">-2</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="right">27</td>
</tr>

<tr>
<td class="right">35</td>
<td class="left">F1(28) (Киров, СОШ 28)</td>
<td class="center">+ (0:27)</td>
<td class="center"> </td>
<td class="center">-1</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">-4</td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center"> </td>
<td class="center">1</td>
<td class="right">27</td>
</tr>
</tbody>
</table>
</div>
</div>


<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2">Материалы</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://neerc.ifmo.ru/school/archive/2014-2015.html#spb-team">Материалы авторов задач</a>
</li>
<li><a href="./2014-runs.7z">Архив подходов участников</a>
</li>
</ul>

</div>
</div>
</div>
</div>
